navStokes/cavity/openFoam/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat       raw;

// Extrusion thickness is d/100 = 0.01, so z=0.005 sits at mid-plane.
sets
(
    verticalCenterline
    {
        // u(y) at x=0.5 -- compare against Ghia et al. (1982) Table I
        type    lineUniform;
        axis    y;
        start   (0.5 0 0.005);
        end     (0.5 1 0.005);
        nPoints 200;
    }

    horizontalCenterline
    {
        // v(x) at y=0.5 -- compare against Ghia et al. (1982) Table II
        type    lineUniform;
        axis    x;
        start   (0 0.5 0.005);
        end     (1 0.5 0.005);
        nPoints 200;
    }
);

fields          (U p);

// ************************************************************************* //
